Layer (type)                                        Output Shape            Param #     Previous Layer                  
========================================================================================================================
data(null)                                          1x80x32                 0                                           
________________________________________________________________________________________________________________________
convolution0(Convolution)                           32x80x32                320         data                            
________________________________________________________________________________________________________________________
batchnorm0(BatchNorm)                               32x80x32                64          convolution0                    
________________________________________________________________________________________________________________________
activation0(Activation)                             32x80x32                0           batchnorm0                      
________________________________________________________________________________________________________________________
dropout0(Dropout)                                   32x80x32                0           activation0                     
________________________________________________________________________________________________________________________
pooling0(Pooling)                                   32x40x16                0           dropout0                        
________________________________________________________________________________________________________________________
convolution1(Convolution)                           32x40x16                9248        pooling0                        
________________________________________________________________________________________________________________________
activation1(Activation)                             32x40x16                0           convolution1                    
________________________________________________________________________________________________________________________
pooling1(Pooling)                                   32x20x8                 0           activation1                     
________________________________________________________________________________________________________________________
convolution2(Convolution)                           16x20x8                 4624        pooling1                        
________________________________________________________________________________________________________________________
batchnorm1(BatchNorm)                               16x20x8                 32          convolution2                    
________________________________________________________________________________________________________________________
activation2(Activation)                             16x20x8                 0           batchnorm1                      
________________________________________________________________________________________________________________________
dropout1(Dropout)                                   16x20x8                 0           activation2                     
________________________________________________________________________________________________________________________
pooling2(Pooling)                                   16x20x4                 0           dropout1                        
________________________________________________________________________________________________________________________
convolution3(Convolution)                           16x20x4                 2320        pooling2                        
________________________________________________________________________________________________________________________
activation3(Activation)                             16x20x4                 0           convolution3                    
________________________________________________________________________________________________________________________
pooling3(Pooling)                                   16x20x2                 0           activation3                     
________________________________________________________________________________________________________________________
convolution4(Convolution)                           16x20x1                 1552        pooling3                        
________________________________________________________________________________________________________________________
slicechannel0(SliceChannel)                                                 0           convolution4                    
________________________________________________________________________________________________________________________
t0_l0_i2h(FullyConnected)                           400                     400         slicechannel0                   
________________________________________________________________________________________________________________________
t0_l0_h2h(FullyConnected)                           400                     400                                         
________________________________________________________________________________________________________________________
