{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(1, 2)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(1, 2)", 
        "pool_type": "max", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 2)", 
        "num_filter": "16", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attrs": {
        "kernel": "(3, 2)", 
        "num_filter": "16", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "kernel": "(3, 2)", 
        "num_filter": "16", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "20", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[39, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[45, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[49, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul2", 
      "inputs": [[46, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 1, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 2, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 3, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 4, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 5, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 6, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 7, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 8, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 9, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 10, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 11, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 12, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 13, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 14, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 15, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 16, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 17, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 18, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l1_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 19, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[77, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t19_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation107", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[83, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation106", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[83, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul60", 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[83, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul61", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[87, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul62", 
      "inputs": [[84, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[93, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[76, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t18_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[96, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation111", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[96, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul63", 
      "inputs": [[98, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation110", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[96, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul64", 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[99, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul65", 
      "inputs": [[97, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[105, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[75, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t17_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul66", 
      "inputs": [[110, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation114", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation115", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[108, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul67", 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[111, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation118", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul68", 
      "inputs": [[109, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[117, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[74, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t16_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation122", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[120, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation121", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[120, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul69", 
      "inputs": [[122, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation119", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation120", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[120, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul70", 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[123, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation123", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul71", 
      "inputs": [[121, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[129, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus48", 
      "inputs": [[73, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t15_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation127", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[132, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation126", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[132, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul72", 
      "inputs": [[134, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation124", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation125", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[132, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul73", 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus49", 
      "inputs": [[135, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation128", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul74", 
      "inputs": [[133, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[141, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus50", 
      "inputs": [[72, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t14_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation132", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[144, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation131", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[144, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul75", 
      "inputs": [[146, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation129", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation130", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[144, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul76", 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus51", 
      "inputs": [[147, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation133", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul77", 
      "inputs": [[145, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[153, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus52", 
      "inputs": [[71, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t13_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation137", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[156, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation136", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[156, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul78", 
      "inputs": [[158, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation134", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation135", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[156, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul79", 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus53", 
      "inputs": [[159, 0, 0], [162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation138", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul80", 
      "inputs": [[157, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[165, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus54", 
      "inputs": [[70, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t12_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation142", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation141", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul81", 
      "inputs": [[170, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation139", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation140", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[168, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul82", 
      "inputs": [[172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus55", 
      "inputs": [[171, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation143", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul83", 
      "inputs": [[169, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[177, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus56", 
      "inputs": [[69, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t11_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation147", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation146", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul84", 
      "inputs": [[182, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation144", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation145", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[180, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul85", 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus57", 
      "inputs": [[183, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation148", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul86", 
      "inputs": [[181, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[189, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus58", 
      "inputs": [[68, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation152", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation151", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul87", 
      "inputs": [[194, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation149", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation150", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[192, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul88", 
      "inputs": [[196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus59", 
      "inputs": [[195, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation153", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul89", 
      "inputs": [[193, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[201, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus60", 
      "inputs": [[67, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation157", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[204, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation156", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[204, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul90", 
      "inputs": [[206, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation154", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation155", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[204, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul91", 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus61", 
      "inputs": [[207, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation158", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul92", 
      "inputs": [[205, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[213, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus62", 
      "inputs": [[66, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation162", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[216, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation161", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[216, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul93", 
      "inputs": [[218, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation159", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation160", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[216, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul94", 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus63", 
      "inputs": [[219, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation163", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul95", 
      "inputs": [[217, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[225, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus64", 
      "inputs": [[65, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation167", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[228, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation166", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[228, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul96", 
      "inputs": [[230, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation164", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation165", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[228, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul97", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus65", 
      "inputs": [[231, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation168", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul98", 
      "inputs": [[229, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[237, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus66", 
      "inputs": [[64, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation172", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation171", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul99", 
      "inputs": [[242, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation169", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation170", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[240, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul100", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus67", 
      "inputs": [[243, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation173", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul101", 
      "inputs": [[241, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[249, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus68", 
      "inputs": [[63, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation177", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation176", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul102", 
      "inputs": [[254, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation174", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation175", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[252, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul103", 
      "inputs": [[256, 0, 0], [257, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus69", 
      "inputs": [[255, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation178", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul104", 
      "inputs": [[253, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[261, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus70", 
      "inputs": [[62, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation182", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[264, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation181", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[264, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul105", 
      "inputs": [[266, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation179", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation180", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[264, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul106", 
      "inputs": [[268, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus71", 
      "inputs": [[267, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation183", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul107", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[273, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus72", 
      "inputs": [[61, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation187", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[276, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation186", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[276, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul108", 
      "inputs": [[278, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation184", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation185", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[276, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul109", 
      "inputs": [[280, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus73", 
      "inputs": [[279, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation188", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul110", 
      "inputs": [[277, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[285, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus74", 
      "inputs": [[60, 0, 0], [286, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation192", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[288, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation191", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[288, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul111", 
      "inputs": [[290, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation189", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation190", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[288, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul112", 
      "inputs": [[292, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus75", 
      "inputs": [[291, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation193", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul113", 
      "inputs": [[289, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[297, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus76", 
      "inputs": [[59, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation197", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[300, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation196", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[300, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul114", 
      "inputs": [[302, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation194", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation195", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[300, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul115", 
      "inputs": [[304, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus77", 
      "inputs": [[303, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation198", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul116", 
      "inputs": [[301, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[309, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus78", 
      "inputs": [[58, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation202", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[312, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation201", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[312, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul117", 
      "inputs": [[314, 0, 0], [307, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation199", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation200", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[312, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul118", 
      "inputs": [[316, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus79", 
      "inputs": [[315, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation203", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul119", 
      "inputs": [[313, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat19", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[55, 0, 0], [321, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[322, 0, 0], [323, 0, 0], [324, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[326, 0, 0], [327, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus80", 
      "inputs": [[325, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l2_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation207", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation206", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_c", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul120", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation204", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation205", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[331, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul121", 
      "inputs": [[336, 0, 0], [337, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus81", 
      "inputs": [[335, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation208", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul122", 
      "inputs": [[332, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l3_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l3_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l3_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[322, 0, 0], [342, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[36, 1, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attrs": {"num_hidden": "400"}, 
      "inputs": [[55, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[345, 0, 0], [346, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attrs": {"num_outputs": "4"}, 
      "inputs": [[347, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[348, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[348, 2, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul3", 
      "inputs": [[350, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[348, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[348, 1, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul4", 
      "inputs": [[352, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[351, 0, 0], [354, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[355, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul5", 
      "inputs": [[349, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat18", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[357, 0, 0], [309, 0, 0]]
    }, 
    {
